[BreakthroughAdvancedModularWeapons X2TechTemplate]
DisplayName="先进的模块化武器"
Summary="外星材料研究的突破使我们能够在不牺牲平衡或火力的情况下为士兵的武器添加额外的升级槽。"

[BreakthroughWeaponUpgradeEffect X2TechTemplate]
DisplayName="改进的武器升级"
Summary="我们在制造和精加工过程中的突破应该会进一步提高所有武器升级的效果。"

[BreakthroughPCSEffect X2TechTemplate]
DisplayName="改进的个人战斗模拟游戏"
Summary="我们的研究突破已经产生了更有效的方法，通过个人战斗模拟来增强神经系统。"



